            // // Печать в консоль всех сотрудников
            // repository.Print("База данных до преобразования");

            // // Увольнение всех работников с именем "Агата"
            // repository.DeleteWorkerByName("Агата");

            // // Печать в консоль сотрудников, которые не попали под увольнение
            // repository.Print("База данных после первого преобразования");

            // // Увольнение всех работников с именем "Аделина"
            // repository.DeleteWorkerByName("Аделина");

            // // Печать в консоль сотрудников, которые не попали под увольнение
            // repository.Print("База данных после второго преобразования");